---
---

<center><h1>üìç üìç Assignment: Sorting and Aggregating Data üìç üìç</h1></center>

---

#### `READ THE DATASET`

---

In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('dataset/time_series.csv')

In [3]:
data.head()

   ID          Datetime  Count
0   0  25-08-2012 00:00      8
1   1  25-08-2012 01:00      2
2   2  25-08-2012 02:00      6
3   3  25-08-2012 03:00      2
4   4  25-08-2012 04:00      2

In [4]:
data.dtypes

ID           int64
Datetime    object
Count        int64
dtype: object

#### `Convert the Datetime column to pandas datetime object`

---

In [7]:
# WRITE YOUR CODE HERE
data.Datetime = pd.to_datetime(data.Datetime)
data.head()

   ID            Datetime  Count
0   0 2012-08-25 00:00:00      8
1   1 2012-08-25 01:00:00      2
2   2 2012-08-25 02:00:00      6
3   3 2012-08-25 03:00:00      2
4   4 2012-08-25 04:00:00      2

In [8]:
# Let's see the dtypes now
data.dtypes

ID                   int64
Datetime    datetime64[ns]
Count                int64
dtype: object

---

####  `Create the following features using the Datetime feature`

- day of month
- month
- day of year
- hour

---

In [16]:
# WRITE YOUR CODE HERE

# day of month
data["day_of_month"] = data.Datetime.dt.day
data.head()

   ID            Datetime  Count  day_of_month
0   0 2012-08-25 00:00:00      8            25
1   1 2012-08-25 01:00:00      2            25
2   2 2012-08-25 02:00:00      6            25
3   3 2012-08-25 03:00:00      2            25
4   4 2012-08-25 04:00:00      2            25

In [20]:
# month
data["month"] = data.Datetime.dt.month_name()
data.head()

   ID            Datetime  Count  day_of_month   month
0   0 2012-08-25 00:00:00      8            25  August
1   1 2012-08-25 01:00:00      2            25  August
2   2 2012-08-25 02:00:00      6            25  August
3   3 2012-08-25 03:00:00      2            25  August
4   4 2012-08-25 04:00:00      2            25  August

In [22]:
# day of year
data["day_of_year"] = data.Datetime.dt.dayofyear
data.head()

   ID            Datetime  Count  day_of_month   month  day_of_year
0   0 2012-08-25 00:00:00      8            25  August          238
1   1 2012-08-25 01:00:00      2            25  August          238
2   2 2012-08-25 02:00:00      6            25  August          238
3   3 2012-08-25 03:00:00      2            25  August          238
4   4 2012-08-25 04:00:00      2            25  August          238

In [24]:
# hour
data["hour"] = data.Datetime.dt.hour
data.head()

   ID            Datetime  Count  day_of_month   month  day_of_year  hour
0   0 2012-08-25 00:00:00      8            25  August          238     0
1   1 2012-08-25 01:00:00      2            25  August          238     1
2   2 2012-08-25 02:00:00      6            25  August          238     2
3   3 2012-08-25 03:00:00      2            25  August          238     3
4   4 2012-08-25 04:00:00      2            25  August          238     4

---

#### `Consider the following dataframe`

---

In [31]:
sample_df = pd.DataFrame({
    'id'   :  [1, 2, 3, 4, 5],
    'name' :  [ 'Akash', 'Akansha', 'Naman', 'Pulkit', 'Anand'],
    'marks':  [ 22, 23, 43, 41, 12]
})
sample_df

   id     name  marks
0   1    Akash     22
1   2  Akansha     23
2   3    Naman     43
3   4   Pulkit     41
4   5    Anand     12

#### Sort the  dataframe by `marks` column in descending order

---

In [32]:
# WRITE YOUR CODE HERE
sample_df.sort_values(by="marks", ascending = False, inplace = True)
sample_df

   id     name  marks
2   3    Naman     43
3   4   Pulkit     41
1   2  Akansha     23
0   1    Akash     22
4   5    Anand     12

#### Consider another dataframe city
---

In [33]:
city = pd.DataFrame({
    'name' : ['Akash', 'Akansha', 'Pulkit', 'Anand', 'Naman'],
    'city' : ['Delhi', 'Gurugram', 'Gurugram', 'Delhi', 'Noida']
})
city

      name      city
0    Akash     Delhi
1  Akansha  Gurugram
2   Pulkit  Gurugram
3    Anand     Delhi
4    Naman     Noida

***Use the dataframe `sample_df` and `city` and find out the age of students who live in Gurugram.***

---

In [52]:
### Write your code here
sample_df_city = sample_df.merge(city, how='inner', on='name')
sample_df_city
#sample_df_city.loc[sample_df_city.city == 'Gurugram']

   id     name  marks      city
0   3    Naman     43     Noida
1   4   Pulkit     41  Gurugram
2   2  Akansha     23  Gurugram
3   1    Akash     22     Delhi
4   5    Anand     12     Delhi

In [55]:
# age column doesn't exist in either of the two data frames
# hence selecting any other column(s)
sample_df_city.loc[sample_df_city.city == 'Gurugram'][['name', 'marks']]

      name  marks
1   Pulkit     41
2  Akansha     23

#### `READ THE BIG MART SALES DATA`

---

In [104]:
big_mart_data = pd.read_csv('dataset/big_mart_sales.csv')

In [57]:
big_mart_data.head()

,Item_Identifier,Item_Weight,Item_Fat_Content,Item_Visibility,Item_Type,Item_MRP,Outlet_Identifier,Outlet_Establishment_Year,Outlet_Size,Outlet_Location_Type,Outlet_Type,Item_Outlet_Sales
0,FDA15,9.30,Low Fat,0.016047,Dairy,249.8092,OUT049,1999,Medium,Tier 1,Supermarket Type1,3735.1380
1,DRC01,5.92,Regular,0.019278,Soft Drinks,48.2692,OUT018,2009,Medium,Tier 3,Supermarket Type2,443.4228
2,FDN15,17.50,Low Fat,0.016760,Meat,141.6180,OUT049,1999,Medium,Tier 1,Supermarket Type1,2097.2700
3,FDX07,19.20,Regular,0.000000,Fruits and Vegetables,182.0950,OUT010,1998,NaN,Tier 3,Grocery Store,732.3800
4,NCD19,8.93,Low Fat,0.000000,Household,53.8614,OUT013,1987,High,Tier 3,Supermarket Type1,994.7052

#### Find out the number of unique `Item_Type` in each of the `Outlet_Identifier`

---

In [76]:
# WRITE YOUR CODE HERE
pd.pivot_table(big_mart_data, index='Outlet_Identifier', values = 'Item_Type', aggfunc = lambda x: len(x.unique()))

# the following simple pivot returns count, but this count contains duplicates, so wrote the above lambda one
#pd.pivot_table(big_mart_data, index='Outlet_Identifier', values = 'Item_Type', aggfunc = 'count')

                   Item_Type
Outlet_Identifier
OUT010                    16
OUT013                    16
OUT017                    16
OUT018                    16
OUT019                    16
OUT027                    16
OUT035                    16
OUT045                    16
OUT046                    16
OUT049                    16

#### Find out the average `Item_Outlet_Sales` for each category of `Outlet_Size`

---

In [77]:
# WRITE YOUR CODE HERE
pd.pivot_table(big_mart_data, index='Outlet_Size', values = 'Item_Outlet_Sales', aggfunc = 'mean')

             Item_Outlet_Sales
Outlet_Size
High               2298.995256
Medium             2681.603542
Small              1912.149161

#### Select only the categorical variables from the dataframe and use `get_dummies` function to convert those into the numerical ones. 

---

In [93]:
# WRITE YOUR CODE HERE

# Simply applying get_dummies on the data frame evolves a lot of unnecessary columns,
# THIS IS NOT ACTUAL GET_DUMMIES, we would be doing data exploration a bit and hopefully
# would obtain a better result.

big_mart_data_dummies = pd.get_dummies(big_mart_data)
big_mart_data_dummies.head()

,Item_Weight,Item_Visibility,Item_MRP,Outlet_Establishment_Year,Item_Outlet_Sales,Item_Identifier_DRA12,Item_Identifier_DRA24,Item_Identifier_DRA59,Item_Identifier_DRB01,Item_Identifier_DRB13,...,Outlet_Size_High,Outlet_Size_Medium,Outlet_Size_Small,Outlet_Location_Type_Tier 1,Outlet_Location_Type_Tier 2,Outlet_Location_Type_Tier 3,Outlet_Type_Grocery Store,Outlet_Type_Supermarket Type1,Outlet_Type_Supermarket Type2,Outlet_Type_Supermarket Type3
0,9.30,0.016047,249.8092,1999,3735.1380,0,0,0,0,0,...,0,1,0,1,0,0,0,1,0,0
1,5.92,0.019278,48.2692,2009,443.4228,0,0,0,0,0,...,0,1,0,0,0,1,0,0,1,0
2,17.50,0.016760,141.6180,1999,2097.2700,0,0,0,0,0,...,0,1,0,1,0,0,0,1,0,0
3,19.20,0.000000,182.0950,1998,732.3800,0,0,0,0,0,...,0,0,0,0,0,1,1,0,0,0
4,8.93,0.000000,53.8614,1987,994.7052,0,0,0,0,0,...,1,0,0,0,0,1,0,1,0,0

In [94]:
# That's too many columns !!!
# Let's see the original data frame
big_mart_data.head()

,Item_Identifier,Item_Weight,Item_Fat_Content,Item_Visibility,Item_Type,Item_MRP,Outlet_Identifier,Outlet_Establishment_Year,Outlet_Size,Outlet_Location_Type,Outlet_Type,Item_Outlet_Sales
0,FDA15,9.30,Low Fat,0.016047,Dairy,249.8092,OUT049,1999,Medium,Tier 1,Supermarket Type1,3735.1380
1,DRC01,5.92,Regular,0.019278,Soft Drinks,48.2692,OUT018,2009,Medium,Tier 3,Supermarket Type2,443.4228
2,FDN15,17.50,Low Fat,0.016760,Meat,141.6180,OUT049,1999,Medium,Tier 1,Supermarket Type1,2097.2700
3,FDX07,19.20,Regular,0.000000,Fruits and Vegetables,182.0950,OUT010,1998,NaN,Tier 3,Grocery Store,732.3800
4,NCD19,8.93,Low Fat,0.000000,Household,53.8614,OUT013,1987,High,Tier 3,Supermarket Type1,994.7052

In [105]:
# Let's see unique value count for each of non-numeric columns
len(big_mart_data.Item_Identifier.unique()), len(big_mart_data.Item_Fat_Content.unique()), len(big_mart_data.Item_Type.unique())

(1559, 5, 16)

In [97]:
len(big_mart_data.Outlet_Identifier.unique()), len(big_mart_data.Outlet_Size.unique()), len(big_mart_data.Outlet_Location_Type.unique())

(10, 4, 3)

In [98]:
len(big_mart_data.Outlet_Type.unique())

4

By looking at the data, Item_Identifier doesn't seem good for numerical conversion, as there are too many values.
Let's see the other ones.

In [99]:
big_mart_data.Item_Type.value_counts()

Fruits and Vegetables    1232
Snack Foods              1200
Household                 910
Frozen Foods              856
Dairy                     682
Canned                    649
Baking Goods              648
Health and Hygiene        520
Soft Drinks               445
Meat                      425
Breads                    251
Hard Drinks               214
Others                    169
Starchy Foods             148
Breakfast                 110
Seafood                    64
Name: Item_Type, dtype: int64

In [100]:
big_mart_data.Outlet_Identifier.value_counts()

OUT027    935
OUT013    932
OUT046    930
OUT049    930
OUT035    930
OUT045    929
OUT018    928
OUT017    926
OUT010    555
OUT019    528
Name: Outlet_Identifier, dtype: int64

Both of the above columns, namely, Outlet_Identifier & Item_Type contain more number of unique values than normally we expect
in a categorical column, Outlet_Identifier doesn't at all signifies at item, a machine can be trained for.

Item type is inherently a categorical one, but it needs to be grouped onto few smaller buckets, as otherwise, it would take time
to train the model on so many features. Also there is apprently no typo in those and normally we cannot club 2 or 3 into one item. Long story short, this is predominantly a categorical one but there are still too many values in it. Should in this case 
we consider the top 3-4 high frequent ones ?

In [101]:
big_mart_data.Item_Fat_Content.value_counts()

Low Fat    5089
Regular    2889
LF          316
reg         117
low fat     112
Name: Item_Fat_Content, dtype: int64

In [106]:
# Obviously typo is noticed and hence we are correcting it via a dictionary/mapper
# this one looks ideal for categorical to numerical conversion
dict_Item_Fat_Content = { 'Low Fat' : 'LF', 'Regular' : 'R', 'LF' : 'LF', 'reg' : 'R', 'low fat' : 'LF' }
big_mart_data.Item_Fat_Content = big_mart_data.Item_Fat_Content.map(dict_Item_Fat_Content)

In [107]:
big_mart_data.Item_Fat_Content.value_counts()

LF    5517
R     3006
Name: Item_Fat_Content, dtype: int64

In [108]:
big_mart_data.Outlet_Size.value_counts()

Medium    2793
Small     2388
High       932
Name: Outlet_Size, dtype: int64

Outlet_Size seems absolute fine and can be considered directly for categorical to numerical conversion,
for machine readability etc.

But why the unique count for it differs from the value_counts () ?
Does it contain nan ? Let's see.

In [111]:
big_mart_data.Outlet_Size.unique()

array(['Medium', nan, 'High', 'Small'], dtype=object)

In [112]:
#So, Outlet_Size contains nan. Let's remove this, before we proceed.
big_mart_data.Outlet_Size.dropna(inplace=True)

In [113]:
big_mart_data.Outlet_Size.unique()

array(['Medium', 'High', 'Small'], dtype=object)

In [109]:
# Now, let's see the outlet_location_type, this seems to be fine per results obtained
big_mart_data.Outlet_Location_Type.value_counts()

Tier 3    3350
Tier 2    2785
Tier 1    2388
Name: Outlet_Location_Type, dtype: int64

Outlet_Location_Type is also fine for converting from categorical to numerical ones.

In [114]:
big_mart_data.Outlet_Type.value_counts()
# Outlet_Type also seems to be fine.

Supermarket Type1    5577
Grocery Store        1083
Supermarket Type3     935
Supermarket Type2     928
Name: Outlet_Type, dtype: int64

In [115]:
# Now let's do get dummies on these columns only
big_mart_data_dummies_actual = pd.get_dummies(big_mart_data, columns = ['Outlet_Type', 'Outlet_Location_Type', 'Outlet_Size', 'Item_Fat_Content'])
big_mart_data_dummies_actual.head(4)

,Item_Identifier,Item_Weight,Item_Visibility,Item_Type,Item_MRP,Outlet_Identifier,Outlet_Establishment_Year,Item_Outlet_Sales,Outlet_Type_Grocery Store,Outlet_Type_Supermarket Type1,Outlet_Type_Supermarket Type2,Outlet_Type_Supermarket Type3,Outlet_Location_Type_Tier 1,Outlet_Location_Type_Tier 2,Outlet_Location_Type_Tier 3,Outlet_Size_High,Outlet_Size_Medium,Outlet_Size_Small,Item_Fat_Content_LF,Item_Fat_Content_R
0,FDA15,9.30,0.016047,Dairy,249.8092,OUT049,1999,3735.1380,0,1,0,0,1,0,0,0,1,0,1,0
1,DRC01,5.92,0.019278,Soft Drinks,48.2692,OUT018,2009,443.4228,0,0,1,0,0,0,1,0,1,0,0,1
2,FDN15,17.50,0.016760,Meat,141.6180,OUT049,1999,2097.2700,0,1,0,0,1,0,0,0,1,0,1,0
3,FDX07,19.20,0.000000,Fruits and Vegetables,182.0950,OUT010,1998,732.3800,1,0,0,0,0,0,1,0,0,0,0,1